# Shell
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "fzf"

# Editor
brew "vim"

# Git
brew "gh"
brew "delta"

# CLI tools
brew "bat"
brew "eza"
brew "jq"
brew "gnu-sed"
brew "tree"
brew "ripgrep"
brew "parallel"
brew "aspell"
brew "ctags"
brew "kubectl"

# Casks
cask "google-cloud-sdk"
